emacs/configs/documentation/00-loader.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org Mode" />
<meta name="viewport" content="width=device-width, initial-scale=1"><link rel="stylesheet" href="/assets/styles/style.css"><link rel="stylesheet" href="/assets/styles/toc-sidebar.css"></head>
<body>
<main id="content" class="content">
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgfe87d9c">1. Documentation Configuration Loader</a>
<ul>
<li><a href="#org0ea4704">1.1. Purpose</a></li>
<li><a href="#org5c12c73">1.2. Architecture</a></li>
<li><a href="#org19ba88f">1.3. Loader Implementation</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-orgfe87d9c" class="outline-2">
<h2 id="orgfe87d9c"><span class="section-number-2">1.</span> Documentation Configuration Loader</h2>
<div class="outline-text-2" id="text-1">
<p>
This file serves as the main entry point for all documentation-related configurations. It loads document format-specific modules.
</p>
</div>

<div id="outline-container-org0ea4704" class="outline-3">
<h3 id="org0ea4704"><span class="section-number-3">1.1.</span> Purpose</h3>
<div class="outline-text-3" id="text-1-1">
<p>
The loader (<code>doc-conf.el</code>) is responsible for:
</p>
<ul class="org-ul">
<li>Loading general documentation settings (<code>doc-general-conf</code>)</li>
<li>Loading Org-mode documentation settings (<code>doc-org-conf</code>)</li>
<li>Loading Markdown documentation settings (<code>doc-md-conf</code>)</li>
</ul>
</div>
</div>

<div id="outline-container-org5c12c73" class="outline-3">
<h3 id="org5c12c73"><span class="section-number-3">1.2.</span> Architecture</h3>
<div class="outline-text-3" id="text-1-2">
<p>
The documentation configuration is modular:
</p>

<pre class="example" id="org0543c6b">
doc-conf.el (this file)
├── doc-general-conf.el   → General documentation settings
├── doc-org-conf.el       → Org-mode settings
└── doc-md-conf.el        → Markdown settings
</pre>
</div>
</div>

<div id="outline-container-org19ba88f" class="outline-3">
<h3 id="org19ba88f"><span class="section-number-3">1.3.</span> Loader Implementation</h3>
<div class="outline-text-3" id="text-1-3">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-comment-delimiter">;;; </span><span class="org-comment">doc-conf.el --- Documentation configuration loader -*- lexical-binding: t; -*-
</span><span class="org-comment-delimiter">;;; </span><span class="org-comment">Commentary:
</span><span class="org-comment-delimiter">;;; </span><span class="org-comment">Main documentation configuration file that loads document format-specific modules.
</span><span class="org-comment-delimiter">;;; </span><span class="org-comment">Code:
</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">Load general documentation configuration
</span>(<span class="org-keyword">require</span> '<span class="org-constant">doc-general-conf</span>)

<span class="org-comment-delimiter">;; </span><span class="org-comment">Load Org-mode documentation configuration
</span>(<span class="org-keyword">require</span> '<span class="org-constant">doc-org-conf</span>)

<span class="org-comment-delimiter">;; </span><span class="org-comment">Load Markdown documentation configuration
</span>(<span class="org-keyword">require</span> '<span class="org-constant">doc-md-conf</span>)

(<span class="org-keyword">provide</span> '<span class="org-constant">doc-conf</span>)
<span class="org-comment-delimiter">;;; </span><span class="org-comment">doc-conf.el ends here
</span>
</pre>
</div>
</div>
</div>
</div>
</main>
</body>
</html>
